// Product data in JS
        const products = [
          {
            id: 1,
            code: "1001",
            name: "សម្លៀកបំពាក់ប្រពៃណី",
            image: "assets/Traditional-01.jpg",
            price: 12.99,
            description: "សម្លៀកបំពាក់នេះត្រូវបានរចនាឡើងដោយបញ្ចូលសមាសភាពសាមញ្ញទាន់សម័យ ប៉ុន្តែរក្សាទុកអត្តសញ្ញាណនៃវប្បធម៌ខ្មែរ។ ជាសម្លៀកបំពាក់សមស្របសម្រាប់កុមារ ពេលចូលរួមពិធីបុណ្យប្រពៃណី ដូចជា បុណ្យចូលឆ្នាំថ្មី បុណ្យភ្ជុំបិណ្ឌ ឬការសម្តែងវប្បធម៌។ សំពត់ដ៏ប្រណិត រចនាមានលំនាំបុរាណបន្សល់ពីសិល្បៈខ្មែរចាស់ៗ ប្រកបដោយសណ្ឋានសោភា និងភាពសមរម្យ។ <br>👗ឈុតនេះបង្ហាញពីភាពស្រស់ស្អាត ដួងចិត្ត និងភាពជាក់ស្តែងនៃក្មេងស្រីខ្មែរ។",
            detailsUrl: "product-details.html",
            shippingFee: 0,
            productDetails: {
              material: "ហូលបារាំង",
              sizes: "ក្មេងក្រោម 20kg",
              colors: "ក្រហម",
              care: "បោកទឹកបាន"
            }
          },
          {
            id: 2,
            code: "1002",
            name: "សម្លៀកបំពាក់ប្រពៃណី",
            image: "assets/Traditional-02.jpg",
            price: 12.99,
            description: "សម្លៀកបំពាក់នេះត្រូវបានរចនាឡើងដោយបញ្ចូលសមាសភាពសាមញ្ញទាន់សម័យ ប៉ុន្តែរក្សាទុកអត្តសញ្ញាណនៃវប្បធម៌ខ្មែរ។ ជាសម្លៀកបំពាក់សមស្របសម្រាប់កុមារ ពេលចូលរួមពិធីបុណ្យប្រពៃណី ដូចជា បុណ្យចូលឆ្នាំថ្មី បុណ្យភ្ជុំបិណ្ឌ ឬការសម្តែងវប្បធម៌។ សំពត់ដ៏ប្រណិត រចនាមានលំនាំបុរាណបន្សល់ពីសិល្បៈខ្មែរចាស់ៗ ប្រកបដោយសណ្ឋានសោភា និងភាពសមរម្យ។ <br>👗ឈុតនេះបង្ហាញពីភាពស្រស់ស្អាត ដួងចិត្ត និងភាពជាក់ស្តែងនៃក្មេងស្រីខ្មែរ។",
            detailsUrl: "product-details.html",
            shippingFee: 0,
            productDetails: {
              material: "ហូលបារាំង",
              sizes: "ក្មេងក្រោម 20kg",
              colors: "ក្រហម",
              care: "បោកទឹកបាន"
            }
          },
          {
            id: 3,
            code: "1003",
            name: "សម្លៀកបំពាក់ប្រពៃណី",
            image: "assets/Traditional-03.jpg",
            price: 12.99,
            description: "សម្លៀកបំពាក់នេះត្រូវបានរចនាឡើងដោយបញ្ចូលសមាសភាពសាមញ្ញទាន់សម័យ ប៉ុន្តែរក្សាទុកអត្តសញ្ញាណនៃវប្បធម៌ខ្មែរ។ ជាសម្លៀកបំពាក់សមស្របសម្រាប់កុមារ ពេលចូលរួមពិធីបុណ្យប្រពៃណី ដូចជា បុណ្យចូលឆ្នាំថ្មី បុណ្យភ្ជុំបិណ្ឌ ឬការសម្តែងវប្បធម៌។ សំពត់ដ៏ប្រណិត រចនាមានលំនាំបុរាណបន្សល់ពីសិល្បៈខ្មែរចាស់ៗ ប្រកបដោយសណ្ឋានសោភា និងភាពសមរម្យ។ <br>👗ឈុតនេះបង្ហាញពីភាពស្រស់ស្អាត ដួងចិត្ត និងភាពជាក់ស្តែងនៃក្មេងស្រីខ្មែរ។",
            detailsUrl: "product-details.html",
            shippingFee: 0,
            productDetails: {
              material: "ហូលបារាំង",
              sizes: "ក្មេងក្រោម 20kg",
              colors: "បៃតង",
              care: "បោកទឹកបាន"
            }
          },
          {
            id: 4,
            code: "1004",
            name: "សម្លៀកបំពាក់ប្រពៃណី",
            image: "assets/Traditional-04.jpg",
            price: 12.99,
            description: "សម្លៀកបំពាក់នេះត្រូវបានរចនាឡើងដោយបញ្ចូលសមាសភាពសាមញ្ញទាន់សម័យ ប៉ុន្តែរក្សាទុកអត្តសញ្ញាណនៃវប្បធម៌ខ្មែរ។ ជាសម្លៀកបំពាក់សមស្របសម្រាប់កុមារ ពេលចូលរួមពិធីបុណ្យប្រពៃណី ដូចជា បុណ្យចូលឆ្នាំថ្មី បុណ្យភ្ជុំបិណ្ឌ ឬការសម្តែងវប្បធម៌។ សំពត់ដ៏ប្រណិត រចនាមានលំនាំបុរាណបន្សល់ពីសិល្បៈខ្មែរចាស់ៗ ប្រកបដោយសណ្ឋានសោភា និងភាពសមរម្យ។ <br>👗ឈុតនេះបង្ហាញពីភាពស្រស់ស្អាត ដួងចិត្ត និងភាពជាក់ស្តែងនៃក្មេងស្រីខ្មែរ។",
            detailsUrl: "product-details.html",
            shippingFee: 0,
            productDetails: {
              material: "ហូលបារាំង",
              sizes: "ក្មេងក្រោម 20kg",
              colors: "ខៀវខ្ចី",
              care: "បោកទឹកបាន"
            }
          },
          {
            id: 5,
            code: "1005",
            name: "សម្លៀកបំពាក់ប្រពៃណី",
            image: "assets/Traditional-05.jpg",
            price: 12.99,
            description: "សម្លៀកបំពាក់នេះត្រូវបានរចនាឡើងដោយបញ្ចូលសមាសភាពសាមញ្ញទាន់សម័យ ប៉ុន្តែរក្សាទុកអត្តសញ្ញាណនៃវប្បធម៌ខ្មែរ។ ជាសម្លៀកបំពាក់សមស្របសម្រាប់កុមារ ពេលចូលរួមពិធីបុណ្យប្រពៃណី ដូចជា បុណ្យចូលឆ្នាំថ្មី បុណ្យភ្ជុំបិណ្ឌ ឬការសម្តែងវប្បធម៌។ សំពត់ដ៏ប្រណិត រចនាមានលំនាំបុរាណបន្សល់ពីសិល្បៈខ្មែរចាស់ៗ ប្រកបដោយសណ្ឋានសោភា និងភាពសមរម្យ។ <br>👗ឈុតនេះបង្ហាញពីភាពស្រស់ស្អាត ដួងចិត្ត និងភាពជាក់ស្តែងនៃក្មេងស្រីខ្មែរ។",
            detailsUrl: "product-details.html",
            shippingFee: 0,
            productDetails: {
              material: "ហូលបារាំង",
              sizes: "ក្មេងក្រោម 20kg",
              colors: "ខ្មៅ + ទឹកមាស",
              care: "បោកទឹកបាន"
            }
          },
          {
            id: 6,
            code: "1006",
            name: "សម្លៀកបំពាក់ប្រពៃណី",
            image: "assets/Traditional-06.jpg",
            price: 12.99,
            description: "សម្លៀកបំពាក់នេះត្រូវបានរចនាឡើងដោយបញ្ចូលសមាសភាពសាមញ្ញទាន់សម័យ ប៉ុន្តែរក្សាទុកអត្តសញ្ញាណនៃវប្បធម៌ខ្មែរ។ ជាសម្លៀកបំពាក់សមស្របសម្រាប់កុមារ ពេលចូលរួមពិធីបុណ្យប្រពៃណី ដូចជា បុណ្យចូលឆ្នាំថ្មី បុណ្យភ្ជុំបិណ្ឌ ឬការសម្តែងវប្បធម៌។ សំពត់ដ៏ប្រណិត រចនាមានលំនាំបុរាណបន្សល់ពីសិល្បៈខ្មែរចាស់ៗ ប្រកបដោយសណ្ឋានសោភា និងភាពសមរម្យ។ <br>👗ឈុតនេះបង្ហាញពីភាពស្រស់ស្អាត ដួងចិត្ត និងភាពជាក់ស្តែងនៃក្មេងស្រីខ្មែរ។",
            detailsUrl: "product-details.html",
            shippingFee: 0,
            productDetails: {
              material: "ហូលបារាំង",
              sizes: "ក្មេងក្រោម 20kg",
              colors: "ត្នោត",
              care: "បោកទឹកបាន"
            }
          }
        ];



